# Lightweight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..Lightweight Property
StructuralAsset Class See Also
---
Flag indicating whether the asset describes a material that is light-weight or not.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool Lightweight { get; set; }
```

Visual Basic
---
```text
Public Property Lightweight As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Lightweight {
	bool get ();
	void set (bool value);
}
```

# See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace